OpenFoamCode/pippoturbo/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 17.83;    // piccola diss 
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    upperWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
}
