OpenFoamCode/pippoturbo/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.001;   // piccolo valore di innesco

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
}
