OpenFoamCode/pippoturbo/0/p
// 0/p

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\      /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
#include "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;  // dal tuo include

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    // Outlet come riferimento p=0
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    // Facce “invisibili” 2D
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
}
// ************************************************************************* //
