OpenFoamCode/pippoturbo/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application simpleFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 40;

deltaT 0.1;

writeControl timeStep;

writeInterval 5;

purgeWrite 5;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
#includeFunc "stressComponents"
#includeFunc "pressureCoefficient"
#includeFunc "sample"
#includeFunc "sampleCp"
#includeFunc "writeCellCentres"
#includeFunc "wallShearStress"
} 	// ************************************************************************* //

